load/jmeter.log
2026-05-25 11:12:32,863 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-25 11:12:32,882 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2026-05-25 11:12:32,882 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2026-05-25 11:12:32,887 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: Version 5.6.3
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: java.version=21.0.11
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: os.name=Linux
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: os.arch=amd64
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: os.version=5.15.0-107-generic
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-25 11:12:32,888 INFO o.a.j.JMeter: Available Processors =8
2026-05-25 11:12:32,899 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-25 11:12:32,899 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-25 11:12:32,899 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2026-05-25 11:12:32,899 INFO o.a.j.JMeter: user.dir  =/home/solo/Documents/SwiftPay/load
2026-05-25 11:12:32,899 INFO o.a.j.JMeter: PWD       =/home/solo/Documents/SwiftPay/load
2026-05-25 11:12:32,900 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: workspace FullName: workspace
2026-05-25 11:12:32,913 INFO o.a.j.s.FileServer: Default base='/home/solo/Documents/SwiftPay/load'
2026-05-25 11:12:32,914 INFO o.a.j.s.FileServer: Set new base='/home/solo/Documents/SwiftPay/load'
2026-05-25 11:12:33,154 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-25 11:12:33,188 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-25 11:12:33,191 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-25 11:12:33,195 INFO o.a.j.s.SaveService: Loading file: swiftpay.jmx
2026-05-25 11:12:33,255 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-25 11:12:33,255 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-25 11:12:33,255 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-25 11:12:33,255 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-25 11:12:33,255 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-25 11:12:33,255 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-25 11:12:33,282 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-25 11:12:33,296 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-25 11:12:33,297 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-25 11:12:33,297 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-25 11:12:33,302 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-25 11:12:33,302 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-25 11:12:33,379 INFO o.a.j.JMeter: Running test (1779687753379)
2026-05-25 11:12:33,407 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 250 TPS Thread Group
2026-05-25 11:12:33,407 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group 250 TPS Thread Group.
2026-05-25 11:12:33,408 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-25 11:12:33,408 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=1 delayedStart=false
2026-05-25 11:12:33,420 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-1
2026-05-25 11:12:33,435 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-2
2026-05-25 11:12:33,450 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-25 11:12:33,450 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-25 11:12:33,457 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-3
2026-05-25 11:12:33,458 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = workspace
2026-05-25 11:12:33,471 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-4
2026-05-25 11:12:33,478 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-25 11:12:33,480 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-25 11:12:33,480 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-25 11:12:33,480 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-25 11:12:33,480 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-25 11:12:33,490 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-5
2026-05-25 11:12:33,509 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-6
2026-05-25 11:12:33,530 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-7
2026-05-25 11:12:33,550 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-8
2026-05-25 11:12:33,569 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-9
2026-05-25 11:12:33,590 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-10
2026-05-25 11:12:33,611 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-11
2026-05-25 11:12:33,629 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-12
2026-05-25 11:12:33,635 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    3.9/s Avg:    78 Min:    78 Max:    78 Err:     0 (0.00%) Active: 12 Started: 12 Finished: 0
2026-05-25 11:12:33,650 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-13
2026-05-25 11:12:33,669 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-14
2026-05-25 11:12:33,693 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-15
2026-05-25 11:12:33,709 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-16
2026-05-25 11:12:33,729 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-17
2026-05-25 11:12:33,748 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-18
2026-05-25 11:12:33,772 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-19
2026-05-25 11:12:33,791 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-20
2026-05-25 11:12:33,809 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-21
2026-05-25 11:12:33,829 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-11
2026-05-25 11:12:33,829 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-11
2026-05-25 11:12:33,832 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-22
2026-05-25 11:12:33,849 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-12
2026-05-25 11:12:33,850 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-12
2026-05-25 11:12:33,851 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-23
2026-05-25 11:12:33,863 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-6
2026-05-25 11:12:33,863 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-6
2026-05-25 11:12:33,867 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-3
2026-05-25 11:12:33,867 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-3
2026-05-25 11:12:33,869 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-24
2026-05-25 11:12:33,871 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-4
2026-05-25 11:12:33,871 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-4
2026-05-25 11:12:33,873 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-2
2026-05-25 11:12:33,873 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-2
2026-05-25 11:12:33,875 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-8
2026-05-25 11:12:33,876 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-8
2026-05-25 11:12:33,889 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-25
2026-05-25 11:12:33,905 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-9
2026-05-25 11:12:33,905 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-9
2026-05-25 11:12:33,909 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-26
2026-05-25 11:12:33,929 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-27
2026-05-25 11:12:33,933 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-1
2026-05-25 11:12:33,933 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-1
2026-05-25 11:12:33,948 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-7
2026-05-25 11:12:33,948 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-7
2026-05-25 11:12:33,949 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-10
2026-05-25 11:12:33,949 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-10
2026-05-25 11:12:33,949 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-5
2026-05-25 11:12:33,949 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-5
2026-05-25 11:12:33,952 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-28
2026-05-25 11:12:33,969 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-29
2026-05-25 11:12:33,991 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-30
2026-05-25 11:12:34,005 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-13
2026-05-25 11:12:34,005 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-13
2026-05-25 11:12:34,009 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-31
2026-05-25 11:12:34,016 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-14
2026-05-25 11:12:34,017 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-14
2026-05-25 11:12:34,029 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-32
2026-05-25 11:12:34,049 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-33
2026-05-25 11:12:34,063 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-15
2026-05-25 11:12:34,063 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-15
2026-05-25 11:12:34,065 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-16
2026-05-25 11:12:34,065 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-16
2026-05-25 11:12:34,067 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-18
2026-05-25 11:12:34,067 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-18
2026-05-25 11:12:34,069 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-34
2026-05-25 11:12:34,089 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-35
2026-05-25 11:12:34,109 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-36
2026-05-25 11:12:34,114 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-17
2026-05-25 11:12:34,114 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-17
2026-05-25 11:12:34,129 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-37
2026-05-25 11:12:34,149 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-38
2026-05-25 11:12:34,164 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-20
2026-05-25 11:12:34,165 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-20
2026-05-25 11:12:34,169 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-39
2026-05-25 11:12:34,175 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-21
2026-05-25 11:12:34,175 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-21
2026-05-25 11:12:34,196 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-40
2026-05-25 11:12:34,201 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-19
2026-05-25 11:12:34,201 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-19
2026-05-25 11:12:34,224 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-41
2026-05-25 11:12:34,228 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-42
2026-05-25 11:12:34,253 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-43
2026-05-25 11:12:34,268 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-44
2026-05-25 11:12:34,274 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-24
2026-05-25 11:12:34,274 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-24
2026-05-25 11:12:34,289 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-45
2026-05-25 11:12:34,309 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-46
2026-05-25 11:12:34,325 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-22
2026-05-25 11:12:34,325 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-26
2026-05-25 11:12:34,326 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-22
2026-05-25 11:12:34,326 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-26
2026-05-25 11:12:34,329 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-47
2026-05-25 11:12:34,349 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-48
2026-05-25 11:12:34,350 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-23
2026-05-25 11:12:34,350 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-23
2026-05-25 11:12:34,373 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-25
2026-05-25 11:12:34,373 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-49
2026-05-25 11:12:34,373 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-28
2026-05-25 11:12:34,373 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-25
2026-05-25 11:12:34,374 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-28
2026-05-25 11:12:34,389 INFO o.a.j.t.JMeterThread: Thread started: 250 TPS Thread Group 1-50
2026-05-25 11:12:34,426 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-27
2026-05-25 11:12:34,426 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-27
2026-05-25 11:12:34,428 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-32
2026-05-25 11:12:34,428 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-32
2026-05-25 11:12:34,470 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-33
2026-05-25 11:12:34,470 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-33
2026-05-25 11:12:34,470 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-31
2026-05-25 11:12:34,470 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-31
2026-05-25 11:12:34,476 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-29
2026-05-25 11:12:34,476 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-29
2026-05-25 11:12:34,515 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-35
2026-05-25 11:12:34,515 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-35
2026-05-25 11:12:34,530 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-34
2026-05-25 11:12:34,530 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-34
2026-05-25 11:12:34,592 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-38
2026-05-25 11:12:34,592 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-38
2026-05-25 11:12:34,595 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-30
2026-05-25 11:12:34,595 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-30
2026-05-25 11:12:34,601 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-45
2026-05-25 11:12:34,601 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-45
2026-05-25 11:12:34,605 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-40
2026-05-25 11:12:34,605 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-40
2026-05-25 11:12:34,613 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-36
2026-05-25 11:12:34,614 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-36
2026-05-25 11:12:34,614 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-37
2026-05-25 11:12:34,615 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-37
2026-05-25 11:12:34,616 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-41
2026-05-25 11:12:34,616 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-41
2026-05-25 11:12:34,624 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-48
2026-05-25 11:12:34,624 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-43
2026-05-25 11:12:34,624 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-43
2026-05-25 11:12:34,624 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-48
2026-05-25 11:12:34,629 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-39
2026-05-25 11:12:34,629 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-39
2026-05-25 11:12:34,632 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-42
2026-05-25 11:12:34,632 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-42
2026-05-25 11:12:34,637 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-46
2026-05-25 11:12:34,638 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-46
2026-05-25 11:12:34,644 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-47
2026-05-25 11:12:34,644 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-47
2026-05-25 11:12:34,652 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-50
2026-05-25 11:12:34,652 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-50
2026-05-25 11:12:34,653 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-44
2026-05-25 11:12:34,653 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-44
2026-05-25 11:12:34,657 INFO o.a.j.t.JMeterThread: Thread is done: 250 TPS Thread Group 1-49
2026-05-25 11:12:34,657 INFO o.a.j.t.JMeterThread: Thread finished: 250 TPS Thread Group 1-49
2026-05-25 11:12:34,657 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-25 11:12:34,658 INFO o.a.j.r.Summariser: summary +    249 in 00:00:01 =  243.2/s Avg:    76 Min:    13 Max:   245 Err:     0 (0.00%) Active: 0 Started: 50 Finished: 50
2026-05-25 11:12:34,659 INFO o.a.j.r.Summariser: summary =    250 in 00:00:01 =  195.3/s Avg:    76 Min:    13 Max:   245 Err:     0 (0.00%)